doctor_appointement_backend/app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
  def index
    doctors = Doctor.all

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    doctor = Doctor.find(params[:id])